In [41]:
import mysql.connector

config = {
  'user': 'root',
  'password': 'root',
  'host': 'localhost',
  'database': 'learning_sql_database',
  'raise_on_warnings': True,
}

link = mysql.connector.connect(**config, buffered=True)

In [13]:
mycursor =  link.cursor()
mycursor.execute(
"""CREATE TABLE sql_lesson_1_movies
(
    Id INT PRIMARY KEY UNIQUE,
    Title VARCHAR(50),
    Director VARCHAR(50),
    Year INT,
    Length_minutes INT)"""
)

In [54]:
mycursor = link.cursor()

sql = "INSERT INTO sql_lesson_1_movies (Id, Title, Director, Year, Length_minutes) VALUES (%s, %s, %s, %s, %s)"
val = (1, "Toy Story", "John Lasseter", 1995, 81)

mycursor.execute(sql, val)

link.commit()
print(mycursor.rowcount, 'record(s) inserted.')

In [53]:
mycursor = link.cursor()

sql = "INSERT INTO sql_lesson_1_movies (Id, Title, Director, Year, Length_minutes) VALUES (%s, %s, %s, %s, %s)"
val = [
    (1, "Toy Story", "John Lasseter", 1995, 81),
    (2, "A Bug's Life", "John Lasseter", 1998, 95),
    (3, "Toy Story 2", "John Lasseter", 1999, 93),
    (4, "Monsters, Inc.", "Pete Docter", 2001, 92),
    (5, "Finding Nemo", "Andrew Stanton", 2003, 107),
    (6, "The Incredibles", "Brad Bird", 2004, 116),
    (7, "Cars", "John Lasseter", 2006, 117),
    (8, "Ratatouille", "Brad Bird", 2007, 115),
    (9, "WALL-E", "Andrew Stanton", 2008, 104),
    (10, "Up", "Pete Docter", 2009, 101)
]

mycursor.executemany(sql, val)

link.commit()
print(mycursor.rowcount, 'record(s) inserted.')

13 record(s) inserted.

In [55]:
import pandas as pd

pd.read_sql_query('SELECT * FROM sql_lesson_1_movies', link)

   Id            Title        Director  Year  Length_minutes
0   1        Toy Story   John Lasseter  1995              81
1   2     A Bug's Life   John Lasseter  1998              95
2   3      Toy Story 2   John Lasseter  1999              93
3   4   Monsters, Inc.     Pete Docter  2001              92
4   5     Finding Nemo  Andrew Stanton  2003             107
5   6  The Incredibles       Brad Bird  2004             116
6   7             Cars   John Lasseter  2006             117
7   8      Ratatouille       Brad Bird  2007             115
8   9           WALL-E  Andrew Stanton  2008             104
9  10               Up     Pete Docter  2009             101

In [ ]:
SELECT